backend/app/models/message.rb

    def self.getMessages
        self.all.map do |message| {
---
SELECT "messages".* FROM "messages"